"""
Реализовать склонение слова «процент» для чисел до 20.
Например, задаем число 5 — получаем «5 процентов»,
задаем число 2 — получаем «2 процента».
Вывести все склонения для проверки.
"""
x = int(input("Введите число от 1 до 20: "))

if x == 1:
    print(x, "процент")
# if 2 in x:
#     print(x, "процента")
# elif x == 5 or 20:
#     print(x, "процентов")

p = {
    1: "процент",
    2: "процента",
    3: "процента",
    4: "процента",
}

print(p)
p = dict.fromkeys([5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20], "процентов")
print(p)